Revit 2024 API
ParameterTypeId.ViewSolarstudySingledayDatetimeText Property
 "Single day date and time text"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId ViewSolarstudySingledayDatetimeText { get; }
Visual Basic
Public Shared ReadOnly Property ViewSolarstudySingledayDatetimeText As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ ViewSolarstudySingledayDatetimeText {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace